In [42]:
import pandas as pd

In [43]:
worker=[ [1,'john',25,5000,2],[2,'tom',35,8000,15],[3,'peter',2,15,30] ]
dfWorker=pd.DataFrame(data=worker,columns=['id','name','age','salary_base_dollar','year_experience'])
dfWorker

   id   name  age  salary_base_dollar  year_experience
0   1   john   25                5000                2
1   2    tom   35                8000               15
2   3  peter    2                  15               30

In [44]:
from sklearn.preprocessing import StandardScaler
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html
numCols=['age','salary_base_dollar','year_experience']
scaler = StandardScaler()
dfWorker.loc[:, numCols] = scaler.fit_transform(dfWorker[numCols])

print(scaler.mean_)
print(scaler.var_)

dfWorker

[  20.66666667 4338.33333333   15.66666667]
[1.90888889e+02 1.08456056e+07 1.30888889e+02]

   id   name       age  salary_base_dollar  year_experience
0   1   john  0.313640            0.200915        -1.194569
1   2    tom  1.037425            1.111865        -0.058272
2   3  peter -1.351066           -1.312780         1.252841

In [81]:

incidnt=[ [1,'Storage','Incident'],[2,'Storage','Incident'],
         [3,'Software','Incident'],[4,'Storage','Request'],
         [5,'Server','Request'] ]
dfIncidnt=pd.DataFrame(data=incidnt,columns=['id','product_type','service_type'])
dfIncidnt

   id product_type service_type
0   1      Storage     Incident
1   2      Storage     Incident
2   3     Software     Incident
3   4      Storage      Request
4   5       Server      Request

In [82]:
from sklearn.preprocessing import LabelEncoder

cateCols=['product_type','service_type']
cateFeatEncoder = LabelEncoder()
for col in cateCols:
 dfIncidnt[col]=cateFeatEncoder.fit_transform(dfIncidnt[col])
dfIncidnt

   id  product_type  service_type
0   1             2             0
1   2             2             0
2   3             1             0
3   4             2             1
4   5             0             1

In [83]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [92]:

incidnt=[ [1,'Storage','Incident'],[2,'Storage','Incident'],
         [3,'Software','Incident'],[4,'Storage','Request'],
         [5,'Server','Request'] ]
dfIncidnt=pd.DataFrame(data=incidnt,columns=['id','product_type','service_type'])
dfIncidnt

   id product_type service_type
0   1      Storage     Incident
1   2      Storage     Incident
2   3     Software     Incident
3   4      Storage      Request
4   5       Server      Request

In [93]:
cateCols=['product_type','service_type']
categorical_transformer = OneHotEncoder(sparse_output=False, handle_unknown="ignore")
ct = ColumnTransformer(transformers=[("", categorical_transformer,cateCols )],remainder='drop',)
ct.set_output(transform='pandas')
dfIncidntCate = ct.fit_transform(dfIncidnt)
dfIncidntCate

,__product_type_Server,__product_type_Software,__product_type_Storage,__service_type_Incident,__service_type_Request
0,0.0,0.0,1.0,1.0,0.0
1,0.0,0.0,1.0,1.0,0.0
2,0.0,1.0,0.0,1.0,0.0
3,0.0,0.0,1.0,0.0,1.0
4,1.0,0.0,0.0,0.0,1.0

In [94]:
dfIncidnt=pd.concat([dfIncidnt['id'],dfIncidntCate],axis=1)
dfIncidnt

,id,__product_type_Server,__product_type_Software,__product_type_Storage,__service_type_Incident,__service_type_Request
0,1,0.0,0.0,1.0,1.0,0.0
1,2,0.0,0.0,1.0,1.0,0.0
2,3,0.0,1.0,0.0,1.0,0.0
3,4,0.0,0.0,1.0,0.0,1.0
4,5,1.0,0.0,0.0,0.0,1.0